package com.sirding.easyexcel.enums;

/**
 * 行业代码
 * @author zhangjun486
 * @version 1.0
 * @date 2020/1/7 16:54
 */
public enum BusinessType {

    /**
     * 内资-国有全资
     */
    NZGYQZ("内资-国有全资","110"),
    /**
     * 内资-集体全资
     */
    NZQTQZ("内资-集体全资","120"),
    /**
     * 内资-股份合作
     */
    NZGFHZ("内资-股份合作","130"),
    /**
     * 内资-联营-国有联营
     */
    NZLYGYLY("内资-联营-国有联营","141"),
    /**
     * 内资-联营-集体联营
     */
    NZLYJTLY("内资-联营-集体联营","142"),
    /**
     * 内资-联营-国有与集体联营
     */
    NZLYGYJTLY("内资-联营-国有与集体联营","143"),
    /**
     * 内资-联营-其他联营
     */
    NZLYQILY("内资-联营-其他联营","149"),
    /**
     * 内资-有限责任(公司)-国有独资(公司)
     */
    NZYXGS("内资-有限责任(公司)-国有独资(公司)","151"),
    /**
     * 内资-有限责任(公司)-其他有限责任(公司)
     */
    NZYXGZQT("内资-有限责任(公司)-其他有限责任(公司)","152"),
    /**
     * 内资-股份有限(公司)
     */
    NZGFYX("内资-股份有限(公司)","160"),
    /**
     * 内资-私有(私营)-独资
     */
    NZSYDZ("内资-私有(私营)-独资","171"),
    /**
     * 内资-私有(私营)-合伙
     */
    NZSYHW("内资-私有(私营)-合伙","172"),
    /**
     * 内资-私有(私营)-有限责任(公司)
     */
    NZSYYXGZ("内资-私有(私营)-有限责任(公司)","173"),
    /**
     * 内资-私有(私营)-股份有限(公司)
     */
    NZSYGFGZ("内资-私有(私营)-股份有限(公司)","174"),
    /**
     * 内资-个体经营
     */
    NZGTJY("内资-个体经营","175"),
    /**
     * 内资-其他私有
     */
    NZQTSY("内资-其他私有","176"),
    /**
     * 内资-其他内资
     */
    NZQTNZ("内资-其他内资","190"),
    /**
     * 港澳台投资-内地和港澳台合资
     */
    GATHZI("港澳台投资-内地和港澳台合资","210"),
    /**
     * 港澳台投资-内地和港澳台合作
     */
    GATHZUO("港澳台投资-内地和港澳台合作","220"),
    /**
     * 港澳台投资-港澳台独资
     */
    GATDZ("港澳台投资-港澳台独资","230"),
    /**
     * 港澳台投资-港澳台投资股份有限(公司)
     */
    GATYXGZ("港澳台投资-港澳台投资股份有限(公司)","240"),
    /**
     * 港澳台投资-其他港澳台投资
     */
    GATQT("港澳台投资-其他港澳台投资","250"),
    /**
     * 国外投资-中外合资
     */
    ZWHZI("国外投资-中外合资","310"),
    /**
     *
     * 国外投资-中外合作
     */
    ZWHZUO("国外投资-中外合作","320"),
    /**
     * 国外投资-外资独资
     */
    WZDZ("国外投资-外资独资","330"),
    /**
     *国外投资-国外投资股份有限(公司)
     */
    GWTZGZ("国外投资-国外投资股份有限(公司)","340"),
    /**
     * 国外投资-其他国外投资
     */
    GWQTTZ("国外投资-其他国外投资","350"),
    /**
     * 个体经营
     */
    GTJY("体经营","400"),
    /**
     * 个体经营－个体户
     */
    GTH("个体经营－个体户","410"),
    /**
     * 个体经营－个人合伙
     */
    GRHH("个体经营－个人合伙","420"),
    /**
     * 国家党政机关
     */
    GJZTJH("国家党政机关","500"),
    /**
     * 事业单位
     */
    SYDW("事业单位","510"),
    /**
     * 军队
     */
    JUND("军队","600"),
    /**
     * 社会团体
     */
    SHTT("社会团体","700"),
    /**
     * 境外公司-外资公司
     */
    WZGS("境外公司-外资公司","810"),
    /**
     * 境外公司-中资公司
     */
    ZZGS("境外公司-中资公司","820"),
    /**
     * 境外公司-金融机构
     */
    JRJG("境外公司-金融机构","830"),
    /**
     * 外国政府
     */
    WGZF("外国政府","900");

    private String name;
    private String type;


    private BusinessType(String name, String type) {
        this.name = name;
        this.type = type;
    }


    public String getName() {
        return name;
    }

    public String getType() {
        return type;
    }

    public static BusinessType getByType(String type){
        for(BusinessType businessType:values()){
            if(type.equals(businessType.getType())) {
                return businessType;
            }
        }
        return  null;
    }
}
