package com.sirding.easyexcel.enums;

/**
 * 民族枚举
 * @author zhangjun486
 * @version 1.0
 * @date 2020/1/6 16:21
 */
public enum Nation {

    /**
     * 汉族
     */
    HANZ("汉族","01"),
    /**
     * 蒙古族
     */
    MGZ("蒙古族","02"),
    /**
     * 回族
     */
    HUIZ("回族","03"),
    /**
     * 藏族
     */
    ZANGZ("藏族","04"),
    /**
     * 维吾尔族
     *
     */
    WWEZ("维吾尔族","05"),
    /**
     * 苗族
     */
    MIAOZ("苗族","06"),
    /**
     *彝族
     */
    YIZ("彝族","07"),
    /**
     * 壮族
     */
    ZHUANGZ("壮族","08"),
    /**
     * 布依族
     */
    BYZ("布依族","09"),
    /**
     * 朝鲜族
     */
    CYZ("朝鲜族","10"),
    /**
     * 满族
     */
    MANZ("满族","11"),
    /**
     * 侗族
     */
    TONGZ("侗族","12"),
    /**
     * 瑶族
     */
    YAOZ("瑶族","13"),
    /**
     * 白族
     */
    BAIZ("白族","14"),
    /**
     * 土家族
     */
    TJZ("土家族","15"),
    /**
     * 哈尼族
     */
    HNZ("哈尼族","16"),
    /**
     * 哈萨克族
     */
    HSKZ("哈萨克族","17"),
    /**
     * 傣族
     */
    TAIZ("傣族","18"),
    /**
     * 黎族
     */
    LZ("黎族","19"),
    /**
     * 僳僳族
     */
    LLZ("僳僳族","20"),
    /**
     * 佤族
     */
    WAZ("佤族","21"),
    /**
     * 畲族
     */
    SHEZ("畲族","22"),
    /**
     *
     * 高山族
     */
    GSZ("高山族","23"),
    /**
     * 拉祜族
     */
    LKZ("拉祜族","24"),
    /**
     * 水族
     */
    SHUIZ("水族","25"),
    /**
     * 东乡族
     */
    DXZ("东乡族","26"),
    /**
     * 纳西族
     */
    NXZ("纳西族","27"),
    /**
     * 景颇族
     */
    JPZ("景颇族","28"),
    /**
     * 柯尔克孜族
     */
    KEKZ("柯尔克孜族","29"),
    /**
     * 土族
     */
    TUZ("土族","30"),
    /**
     * 达斡尔族
     */
    DWEZ("达斡尔族","31"),
    /**
     * 仫佬族
     */
    MLZ("仫佬族","32"),
    /**
     * 羌族
     */
    QIANGZ("羌族","33"),
    /**
     * 布朗族
     */
    BLZ("布朗族","34"),
    /**
     * 撒拉族
     */
    SLZ("撒拉族","35"),
    /**
     *毛难族
     */
    MNZ("毛难族","36"),
    /**
     * 仡佬族
     */
    GLZ("仡佬族","37"),
    /**
     * 锡伯族
     */
    XBZ("锡伯族","38"),
    /**
     * 阿昌族
     */
    ACZ("阿昌族","39"),
    /**
     * 普米族
     */
    PMZ("普米族","40"),
    /**
     * 塔吉克族
     */
    TJKZ("塔吉克族","41"),
    /**
     * 怒族
     */
    NUZ("怒族","42"),
    /**
     * 乌孜别克族
     */

    WZBKZ("乌孜别克族","43"),
    /**
     * 俄罗斯族
     */
    ELSZ("俄罗斯族","44"),
    /**
     * 鄂温克族
     */
    EWKZ("鄂温克族","45"),
    /**
     * 崩龙族
     */
    BENGZ("崩龙族","46"),
    /**
     * 保安族
     */
    BAZ("保安族","47"),
    /**
     * 裕固族
     */
    YGZ("裕固族","48"),
    /**
     * 京族
     */
    JINGZ("京族","49"),
    /**
     * 塔塔尔族
     */
    TTEZ("塔塔尔族","50"),
    /**
     * 独龙族
     */
    DLZ("独龙族","51"),
    /**
     *
     * 鄂伦春族
     */
    ELCZ("鄂伦春族","52"),
    /**
     * 赫哲族
     */
    HZZ("赫哲族","53"),
    /**
     * 门巴族
     */
    MBZ("门巴族","54"),
    /**
     * 珞巴族
     */
    LBZ("珞巴族","55"),
    /**
     * 基诺族
     */
    JNZ("基诺族","56"),
    /**
     * 其他
     */
    OTHER("其他","57"),
    /**
     * 外国血统
     */
    WGXT("外国血统","58");

    private String name;
    private String type;

    public String getName() {
        return name;
    }

    public String getType() {
        return type;
    }

    private Nation(String name, String type){
        this.name=name;
        this.type=type;
    }

    public static Nation getByType(String type){
        for(Nation nation:values()){
            if(type.equals(nation.getType())) {
                return nation;
            }
        }
        return  null;
    }
}
